import React, {useState} from "react";
import plusIcon from "../assets/Our day/+.svg"
import "../styles/Accordion.scss"



const items = [
    {title: "Ինչու՞ մեր ծրագիրը ?", content: "London Bus մանկական զարգացման կենտրոնում յուրաքանչյուր երեխայի՝ խաղալու, սովորելու և զարգանալու ընթացքը կազմակերպված է սիրով, հոգատարությամբ և փորձագիտական մոտեցմամբ։Մեր աշխատանքային մոտեցումը հիմնված է հետևյալ սկզբունքների վրա՝ Մենք սկսում ենք երեխայի կարիքների գնահատումից։ Յուրաքանչյուր նոր գրանցման դեպքում մեր մասնագետները դիտարկում են երեխայի տարիքը, զարգացման փուլը և լեզվական կարողությունները՝ ձևավորելով նրան համապատասխան խումբ։"},
    {title: "Ինչ ծրագրեր են գործում Լոնդոն բասում ?", content: "Լոնդոն բասում գործում է «Նախապատրաստում մանկապարտեզին» ծրագիրը՝ նախատեսված 2-4 տարեկան երեխաների համար։Մեր նպատակն է օգնել փոքրիկներին՝ Հարմարվել նոր միջավայրին, Զարգացնել ինքնուրույնության հմտությունները,  Խթանել հաղորդակցությունն ու սոցիալականացումը, Սովորել մանկապարտեզին անհրաժեշտ հմտություններ խաղերի միջոցով"},
    {title: "Ինչ է Baby plus mommy  ծրագիրը ?", content: "Baby plus mommy &nbsp;ծրագրում ներառված են՝ զարգացնող խաղեր՝ գունավոր խաղալիքներով, պլաստիլինով, զանազան սենսորիկ նյութերով, երաժշտական խաղեր, երգ ու պար՝ խոսքի և լսողության խթանման համար, մատների և մարմնի շարժումների վարժություններ՝ ֆիզիկական կոորդինացիայի համարԱնգլերեն բառերի ու արտահայտությունների ճանաչում խաղերի միջոցով։"},
    {title: "Քանի՞ տարեկանից է ընդունելությունը ? ", content: "Լոնդոն Բասում գործում է «Նախապատրաստում մանկապարտեզին» ծրագիրը՝ նախատեսված 2-4 տարեկան երեխաների համար։Մեր նպատակն է օգնել փոքրիկներին՝ Հարմարվել նոր միջավայրին, զարգացնել ինքնուրույնության հմտությունները,  խթանել հաղորդակցությունն ու սոցիալականացումը, սովորել մանկապարտեզին անհրաժեշտ հմտություններ խաղերի միջոցով։Երեխան ավելի վստահ է զգում, երբ մոր ներկայությամբ բացահայտում է նոր միջավայր և ստեղծվում է ուժեղ էմոցիոնալ կապ մայրիկի և փոքրիկի միջև։"},
    {title: "երբ կմեկնարկի է «English for kids» ծրագիրը ?", content: ""}
];

const AccordionItem = ({ title, content, isOpen, onClick }) => {
  return (
    <div className="accordion__item">
      <div
        className={`accordion__title ${isOpen ? "active" : ""}`}
        onClick={onClick}
      >
        {title}
        <img
          src={plusIcon}
          alt="plus"
          className="accordion__icon"
        />
      </div>
      {isOpen && <div className="accordion__content">{content}</div>}
    </div>
  );
};

const Accordion = () => {
    const [openIndex, setOpenIndex] = useState(null);

    const toggleItem  = (index) => {
        setOpenIndex(openIndex === index? null : index);
    };

    return (
    <div className="accordion">
      {items.map((item, index) => (
        <AccordionItem
          key={index}
          title={item.title}
          content={item.content}
          isOpen={openIndex === index}
          onClick={() => toggleItem(index)}
        />
      ))}
    </div>
  );
};

export default Accordion;